//25 ВП2, Варламова Елизавета. Лабораторная работа 2.
//1.
//Построить таблицу с исключающим ИЛИ (если значение равны - 1, иначе - 0)

//объяснить ^ - отрицание
#include <iostream>
using namespace std;
int main() {
    for (int x = 0; x <= 1; ++x) {
        for (int y = 0; y <= 1; ++y) {
            bool k = !(x ^ y);
            cout << x << y << k << endl;
        }
    }

/*
//4.
// Если 2 числа из 3х больше 0 и кратны 3 - 1, иначе 0


    int x = 3, y = 1, z = 0, k = 0, i = 0;
    if (x > 0 && x % 3 == 0) {
        i++;
    }
    if (y > 0 && y % 3 == 0) {
        i++;
    }
    if (z > 0 && z % 3 == 0) {
        i++;
    }
    if (i == 2) {
        k++;
    }
	cout << k;


//5.
// Вывести наименьшее из 3 значений

    int a = 1, b = 2, c = -3, m;
    m = (a < b) ? a : b;
    if (c < m) {
        m = c;
    }
    cout << "m=" << m << endl;


//6. k=1, если точка с координатами xy принадлежит области, иначе - 0.


    float x = -0.5, y = 1;
    bool k = (fabs(x) + fabs(y) <= 1);
    cout << k;
    return 0;

//7 (c) для числа n определить число из вписывания в обратном порядке цифр заданного натурального числа.

    int n = 123,r = 0,t = n;
    while (t != 0) {
        r = r * 10 + t % 10;
        t /= 10;
    }
    cout << n << "\t" << r << endl;

//7 (d) является ли число палиндромом

    int n = 616; t = n; r = 0;

    while (t > 0) {
        int d = t % 10;
        r = r * 10 + d;
        t /= 10;
    }
    int d = (n == r) ? 1 : 0;

    cout << d;
    return 0;

    

//8. десятичный эквивалент целого двоичного числа (n)


   int n = 11, d = 0, 
                b = 1; // Степень двойки
   while (n > 0) {
       if (n % 10 == 1) {
           d += b;
       }
       n /= 10;
       b *= 2;
   }
        //перевод в десятич
   cout << d << endl;
   */
}