/*25вп2, Варламова Елизавета
Лабораторная работа 4, вариант 2.
найти минимальный элемент на главной диагонали квадратной матрицы а
сделать из элементов строки и столбца, на пересечении которых этот эл-т находится
новый одномерный массив В*/
#include <iostream>
using namespace std;

int main() {
	setlocale(LC_ALL, "Russian");

	// задаем массив (mas - исходник. а - строки, столбцы)
	const int N = 3;
	int mas[N][N]{ {6,1,2},{-9,-13,-7},{-1,6,-4} };

	//значения исход массива
	cout << "исходный массив: " << endl;
	for (int i = 0; i < N; i++) {
		for (int j = 0; j < N; j++) {
			cout << mas[i][j] << "\t";
		}
			cout << endl;
	}
	cout << endl;

	//поиск минимального значения
	int min = 0;
	for (int i = 1; i < N; ++i) {
		if (mas[i][i] < mas[min][min]) {
			min = i;
		}
	}

	// вывод минимального элемента массива (главная диагональ)
	cout << "минимальный элемент диагонали: " << mas[min][min]<< endl;

	//создание массива б (bas)
	const int M = N * 2 - 1;
	int bas[M]{};
	
	//запись элементов в массив
	for (int i = 0; i < N; ++i) {
		bas[i] = mas[i][min];
	}
	int L = N;
	for (int i = 0; i < N; ++i) {
		if (i != min) {				// исключаем повторяющийся элемент
			bas[L] = mas[min][i];
			++L;
		}
	}

	//вывод
	cout << "Новый массив, образованный из из эл-ов строки и столбца, где расположен мин. эл-т: " << endl;
	for (int i = 0; i < M; ++i) {
		cout << bas[i] << " ";
	}

	return 0;
}