/* 25вп2. Варламова Елизавета. Лабораторная работа 1,2,3, 4. вариант 2.*/
/* Очередь длинной N с приоритетами задана как однонаправленный
линейный список. Элементы с большим приоритетом - ближе к началу очереди. При добавлении эл-а в очередь
он располагается в конце эл-ов своего приоритета.*/
/*функции:
поместить эл-т в очередь согласно своему приоритету
выбрать элемент из очереди (из начала списка), вывести содержимое очереди, определить текущую длину очереди
очередь пуста?, очередь заполнена?,+ исключение , очистка памяти
для класса реализовать конструкторы: по–умолчанию и с параметрами (???), объединенный конструктор с параметрами по умолчанию, копирования.
Реализовать объектно-ориентированное многофайловое приложение С++ с использованием операторов перегрузки:
    операции присваивания;
    операции вывода данных на консоль (<<);
	бинарный + – увеличивает значения исходной очереди первым, подходящим по приоритету, значением второй очереди
    Реализовать объектно-ориентированное многофайловое приложение С++ с использованием шаблонов классов.

*/
#include "Queue.h"

int main() {
    setlocale(LC_ALL, "Russian");
    PriorityQueue<double> q1(5);
    PriorityQueue<string> q3({
    {"яблоко", 2},
    {"ананас", 5},
    {"кот", 1}
        });
    PriorityQueue<string> q4;
    PriorityQueue<double> qp;

    //q3 - очередь через конструктор инициализации
    cout << "Очередь через конструктор инициализации - q3:" << endl;
    cout<< q3 << endl;

    //копия через перегрузку, изменяем q4
    cout << "Копируем очередь через перегрузку. (q4=q3) " << endl;
    q4 = q3;
    cout << "Очередь q4:" << endl << q4 << endl;

    //выбираем элемент из q4
    string vq;
    int pq;
    q4.pop(vq, pq);
    cout << "Выбор первого элемента из очереди q4 (копия q3): " << vq << endl;
    cout << "Приоритет: " << pq << endl;
    cout << "q4: " << q4;
    // смотрим изменения в исходной очереди, удаляем обе очереди
    cout << "q3: " << q3 << endl;
    cout << "Очищаем очередь q4 и q3... " << endl;
    q3.clear(); q4.clear();
    cout << endl;

    // добавление элементов в q1:
    q1.push(10,10); q1.push(20,20); q1.push(50,30); q1.push(40,40); q1.push(30,30);  
    cout << "Исходная очередь q1:" << endl;
    q1.print();
    cout << "Длина очереди: " << q1.size() << endl;
    cout << endl;

    //копирование
    PriorityQueue<double> q2(q1);
    
    // выбор элемента
    double v;
    int p;
    q2.pop(v, p);
    cout << "Выбор первого элемента из очереди q2 (копия q1): " << v << " Приоритет: " << p << endl;
    q2.print();
    cout << "Длина очереди: " << q2.size() << endl;
    
    // + элемент
    int v1 = 70;
    int p1= 70;
    cout << endl << "Очередь q2 с добавлением 1 элемента: " << v1 << " Приоритет: " << v1 << endl;
    q2.push(v1, p1);
    cout << endl;
    q2.print();
    cout << "Длина очереди: " << q2.size() << endl;
    cout << endl;

    // + элементы (переполнение)
    cout << "Очередь q2 с добавлением 2 элемента: " << v1 << " Приоритет: " << p1 << endl;
    q2.push(v1,p1);
    q2.print();
    cout << "Длина очереди: " << endl;
    q2.size();
    cout << endl;

    //доавляем очередь qp, чтобы скопировать в нее содержимое q2 перед очисткой
    cout << "qp=q2 " << endl;
    qp = q2;
    cout << endl;

    // очистка памяти
    cout << "Очищаем очередь q2... " << endl;
    q2.clear();
    cout << "Очередь q2: " << q2.size() << endl;
    q2.print();
    cout << endl;
    cout << "Длина очереди: " << q2.size() << endl;
    cout << endl;

    //  вытаскивание эл-а из пустой очереди
    cout << "Пытаемся удалить элемент q2..." << endl;
    q2.pop(v, p);
    cout << endl;
    cout << "Длина очереди: " << q2.size() << endl;
    cout << endl;

    //добавляем элементы в очередь
    double v3 = 120;
    int p3 = 120;
    cout << "Новая очередь с добавлением элемента в q2: " << v3 << " Приоритет: " << v3 << endl;
    q2.push(v3,p3);
    q2.print();
    cout << "Длина очереди: " << q2.size() << endl;
    //сносим q2
    cout << "Очищаем очередь q2... " << endl;
    q2.clear();
    cout << endl;

    //смотрим исходник:
    cout << "Исходная очередь q1: \n" << q1<< endl;
    cout << "Вторая очередь qp : \n" << qp << endl;
    
    //используем qp и исходную очередь для сложения
    q1 = q1 + qp;
    cout << "Обновленная очередь q1 : \n" << q1 << endl;
}