/* 25вп2. Варламова Елизавета. Лабораторная работа 11, вариант 2.*/
/* Очередь длинной N с приоритетами задана как однонаправленный
линейный список. Элементы с большим приоритетом - ближе к началу очереди. При добавлении эл-а в очередь
он располагается в конце эл-ов своего приоритета.*/
/*функции:
поместить эл-т в оче   редь согласно своему приоритету !
выбрать элемент из очереди (из начала списка) !
вывести содержимое очереди
определить текущую длину очереди
очередь пуста?
очередь заполнена?
+ исключение
очистка памяти
*/
#include "Queue.h"
#include <iostream>
#include <queue>
using namespace std;

int main() {
    setlocale(LC_ALL, "Russian");

    //исходные данные:
    PriorityQueue q;
    initQueue(q, 5); // очередь длиной 5
    int v9, p9;
    pop(q, v9, p9);
    //добавление элементов:
    push(q, 10, 1); push(q, 20, 3); push(q, 30, 2); push(q, 40, 3); push(q, 50, 5);
    cout << "Исходная очередь:" << endl;
    printQueue(q);
    cout << "Текущая длина очереди: " << q.size << endl;
    cout << endl;

    //выбор элемента из очереди (из начала списка) ???
    int v, p;
    pop(q, v, p);
    cout << "Выбор первого элемента из очереди: " << v << " " << endl;
    printQueue(q);
    cout << "Текущая длина очереди: " << q.size << endl;
    cout << endl;

    //+ элемент
    cout << "Новая очередь с добавлением элемента : " << endl;
    push(q, 60, 5);
    printQueue(q);
    cout << "Текущая длина очереди: " << q.size << endl;
    cout << endl;

    //+ элемент (добиваемся переполнения)
    cout << "Новая очередь с добавлением элемента: " << endl;
    push(q, 100, 4);
    printQueue(q);
    cout << "Текущая длина очереди: " << q.size << endl;
    cout << endl;

    //очистка памяти
    cout << "Очищаем очередь... " << endl;
    clearQueue(q);
    cout << "Очередь: " << endl;
    printQueue(q);
    cout << "Текущая длина очереди: " << q.size << endl;
    int v1, p1;
    cout << endl;

    //попытка вытащить из пустой очереди элемент?
    cout << "Пытаемся удалить элемент..." << endl;
    pop(q, v1, p1);
    cout << "Текущая длина очереди: " << q.size << endl;
    cout << endl;
    return 0;