/* 25вп2. Варламова Елизавета. Лабораторная работа 3-4. вариант 2.*/
/* Очередь длинной N с приоритетами задана как однонаправленный
линейный список. Элементы с большим приоритетом - ближе к началу очереди. При добавлении эл-а в очередь
он располагается в конце эл-ов своего приоритета.*/
/*функции:
поместить эл-т в очередь согласно своему приоритету
выбрать элемент из очереди (из начала списка), вывести содержимое очереди, определить текущую длину очереди
очередь пуста?, очередь заполнена?,+ исключение , очистка памяти

Реализовать объектно-ориентированное многофайловое приложение С++ с использованием операторов перегрузки:
	операции присваивания;
	операции вывода данных на консоль (<<);
	арифметических и логических операций
    Реализовать объектно-ориентированное многофайловое приложение С++ с использованием шаблонов классов.
*/
#include "Queue.h"

int main() {
    setlocale(LC_ALL, "Russian");
    PriorityQueue <int> qA({ 10, 20, 30 });

    //q3 - очередь через конструктор инициализации
    cout << "Очередь через конструктор инициализации - qA:" << endl;
    cout << qA<< endl;

    PriorityQueue<double> q1(5);

    // добавление элементов:
    q1.push(10,10); q1.push(20,20); q1.push(30,30); q1.push(40.6,40); q1.push(50,50);  
    cout << "Исходная очередь q1:" << endl;
    cout << q1;
    cout<<"Длина очереди: "<< q1.size() << endl;
    cout << endl;

    //копирование
    PriorityQueue<double> q2(q1);
    
    // выбор элемента
    double v;
    int p;
    q2.pop(v, p);
    cout << "Выбор первого элемента из очереди q2 (копия q1): " << v << endl;
    cout<< "Приоритет: " << p << endl;
    cout << q2;
    cout << "Длина очереди: " << q2.size() << endl;
    cout << endl;
    
    //присваиваем q3 значение q2 через перегруженное "="
    cout << "Создаем копию q3=q2...";
    PriorityQueue<double> q3;
    q3 = q2;
    cout << endl;
    
    // + элемент
    double v1 = 60.1;
    int p1 = 60;
    cout << endl << "Очередь q2 с добавлением 1 элемента: " << v1 << endl;
    cout<< "Приоритет: " << p1 << endl;
    q2.push(v1,p1);
    cout << q2;
    cout << "Длина очереди: " << q2.size() << endl;
    cout << endl;

    // + элементы (переполнение)
    double v2 = 606;
    int p2 = static_cast<int> (v2);
    cout << "Очередь q2 с добавлением 2 элемента: " << v2 << endl;
    cout << "Приоритет: " << p2 << endl;
    q2.push(v2,p2);
    cout << q2;
    cout << "Длина очереди: " << q2.size() << endl;
    cout << endl;

    // очистка памяти
    cout << "Очищаем очередь q2... " << endl;
    q2.clear();
    cout << "Очередь q2: " << endl;
    cout << q2 << endl;;
    cout << "Длина очереди: " << q2.size() << endl;
    cout << endl;

    //  вытаскивание эл-а из пустой очереди
    cout << "Пытаемся удалить элемент q2..." << endl;
    q2.pop(v, p);
    cout<< endl;
    cout << "Длина очереди: " << q2.size() << endl;
    cout << endl;

    //добавляем элемент в очередь
    double v3 = 60.21;
    int p3 = 60;
    cout << "Новая очередь с добавлением элемента в q2: " << v3 << endl;
    cout<< "Приоритет: " << p3 << endl;
    q2.push(v3,p3);
    cout << q2;
    cout << "Длина очереди: " << q2.size() << endl;
    cout << endl;

    //смотрим исходник:
    cout << "Исходная очередь q1:" << endl;
    cout << q1;
    cout << "Длина очереди: " << q1.size() << endl;
    cout << endl;

    //проверка присваивания
    cout << "q3 = q2 до дополнения элементов:" << endl;
    cout << q3;
    cout << "Длина очереди: " << q3.size() << endl;
    cout << endl;
    
    //добавляем элемент в q3
    double vA = 50;
    int pA = 9;
    cout << "Очередь q3 с добавлением 1 элемента: " << vA << endl;
    cout<< "Приоритет: "<< pA << endl;
    q3.push(vA,pA);
    cout << q3;
    cout << "Длина очереди: " << q3.size() << endl;
    cout << endl;

    //бинарный плюс
    PriorityQueue<double> result = q1 + q3;
    cout << "Очередь q1+q3(+ перегружен - + увеличивает значения исходной очереди первым, подходящим по приоритету, значением второй очереди): " << endl;
    cout << result;
    cout << "Длина очереди: " << result.size() << endl;
    return 0;
}